# =================== Helpers ===================

brew "bat"
brew "diff-so-fancy"
brew "fd"
brew "httpie"
brew "jq"
brew "p7zip"
brew "shellcheck"
brew "the_silver_searcher"

# ================== Required ==================

# required to manage xcode versions
tap "xcodesorg/made"
brew "xcodesorg/made/xcodes"

# required by asdf to compile ruby and python
brew "openssl@3"
brew "readline"

# required by asdf to compile ruby
brew "rust"
brew "ruby-build"
brew "libyaml"
brew "gmp"

# required by asdf to compile python
brew "sqlite3"
brew "xz"
brew "zlib"
brew "tcl-tk"

# flutter: htmlgen
brew "lcov"
